Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/main.c
// Ethernet Framework for Projects 1 and 2
// Spring 2025
// Jason Losh

//-----------------------------------------------------------------------------
// Hardware Target
//-----------------------------------------------------------------------------

// Target Platform: EK-TM4C123GXL w/ ENC28J60
// Target uC:       TM4C123GH6PM
// System Clock:    40 MHz

// Hardware configuration:
// ENC28J60 Ethernet controller on SPI0
//   MOSI (SSI0Tx) on PA5
//   MISO (SSI0Rx) on PA4
//   SCLK (SSI0Clk) on PA2
//   ~CS (SW controlled) on PA3
//   WOL on PB3
//   INT on PC6

// Pinning for IoT projects with wireless modules:
// N24L01+ RF transceiver
//   MOSI (SSI0Tx) on PA5
//   MISO (SSI0Rx) on PA4
//   SCLK (SSI0Clk) on PA2
//   ~CS on PE0
//   INT on PB2
// Xbee module
//   DIN (UART1TX) on PC5
//   DOUT (UART1RX) on PC4

//-----------------------------------------------------------------------------
// Device includes, defines, and assembler directives
//-----------------------------------------------------------------------------

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
#include "tm4c123gh6pm.h"
#include "clock.h"
#include "gpio.h"
#include "uart0.h"
#include "wait.h"
#include "timer.h"
#include "nrfModule.h"

#include "common.h"

// Pins
#define RED_LED PORTF,1
#define BLUE_LED PORTF,2
#define GREEN_LED PORTF,3
#define PUSH_BUTTON PORTF,4

// Custom . README
#define F_CPU 40e6
#define UART0_BAUD 9600
#define WIRELESS_RX_BUFFER_SIZE 200
#define NRF_F_CHANNEL 10
#define NRF_A_ADDR {1,2,3,4,5}

//-----------------------------------------------------------------------------
// Subroutines                
//-----------------------------------------------------------------------------

// Initialize Hardware
void initHw()
{
    initSystemClockTo40Mhz();

    // Enable clocks
    enablePort(PORTF);
    _delay_cycles(3);

    // Configure LED and pushbutton pins
    selectPinPushPullOutput(RED_LED);
    selectPinPushPullOutput(GREEN_LED);
    selectPinPushPullOutput(BLUE_LED);
    selectPinDigitalInput(PUSH_BUTTON);
    enablePinPullup(PUSH_BUTTON);
}

#define MAX_CHARS 80
char strInput[MAX_CHARS+1];
char* token;
uint8_t count = 0;

uint8_t asciiToUint8(const char str[])
{
    uint8_t data;
    if (str[0] == '0' && tolower(str[1]) == 'x')
        sscanf(str, "%hhx", &data);
    else
        sscanf(str, "%hhu", &data);
    return data;
}

void printNRFStats();
void printNRFStatus(NRFStatus);
void printFIFORX();
void printFIFOTX();
void processShell()
{
    if (kbhitUart0())
    {
        char c = getcUart0();
        bool end = (c == 13) || (count == MAX_CHARS);

        if (!end)
        {
            if ((c == 8 || c == 127) && count > 0){
                count--;
                putcUart0(c);
            }
            if (c >= ' ' && c < 127){
                strInput[count++] = c;
                putcUart0(c);
            }
        }
        else
        {
            putsUart0("\n\r");
            strInput[count] = '\0';
            count = 0;
            token = strtok(strInput, " ");

            if (strcmp(token, "rx") == 0){

                nrfSetCRCEnable(false);
                nrfSetCRCUse2B(true);

                nrfActAsReceiver();

                nrfSetEnableAutoAck((NRFPipes){0});

                nrfSetAddressWidths(NRF_ADDR_WIDTH_5B);
//                nrfSetEnableRXAddr((NRFPipes){NRF_DATAPIPE_0});

                nrfSetChannel(NRF_F_CHANNEL);

                nrfSetDataRate(NRF_DATARATE_250kbps);

                nrfSetRXPipePayloadWidth((NRFPipes){NRF_DATAPIPE_0}, sizeof(nrfPacketBase)); // pipe0 width of 32B

                nrfSetPowerUp(true);

                printNRFStats();

                nrfSetChipEnable(true);

                char str[20];
                uint8_t fifocount;
                while(true){
                    waitMicrosecond(1000e3);

                    nrfGetPipeFIFOCount((NRFPipes){NRF_DATAPIPE_0}, &fifocount);
                    snprintf(str,sizeof(str), "%02d\n\r", fifocount);
                    putsUart0(str);

                    printFIFORX();

                    nrfGetPipeFIFOCount((NRFPipes){NRF_DATAPIPE_0}, &fifocount);
                    snprintf(str,sizeof(str), "%02d\n\r", fifocount);
                    putsUart0(str);

                    putcUart0('0' + nrfIsReceivedPowerDetected());
                    putsUart0("-------------------rx\n\r");
                }
            }

            if (strcmp(token, "tx") == 0){
                nrfSetOutputPower(NRF_OUTPUT_POWER_0dBm);

                nrfSetAddressWidths(NRF_ADDR_WIDTH_5B);
//                {
//                    uint8_t addr[5] = NRF_A_ADDR;
//                    nrfSetTXAddr(addr);
//                }

                nrfSetCRCEnable(false);
                nrfSetCRCUse2B(true);

                nrfActAsTransmitter();

                nrfSetAutoRetransmitTries(0);               // disable auto ack

                nrfSetChannel(NRF_F_CHANNEL);

                nrfSetDataRate(NRF_DATARATE_250kbps);

                nrfSetPowerUp(true);

                printNRFStats();

                nrfPacketBase pkt;
                for(int i = 0; i < sizeof(pkt); i++)
                    pkt.rawArr[i] = 0xAA;

                while(true){
                    nrfWriteTXPayload(pkt.rawArr, sizeof(nrfPacketBase));

                    printFIFOTX();
                    nrfSetChipEnable(true);
                    nrfSetChipEnable(false);

                    putcUart0('0' + nrfIsReceivedPowerDetected());
                    putsUart0("-------------------tx\n\r");

                    waitMicrosecond(1000e3);
                }
            }

            if (strcmp(token, "info") == 0)
            {
                printNRFStats();
            }

            if (strcmp(token, "help") == 0)
            {
                putsUart0("green led on indicates IRQ pin is active\n\r");
                putsUart0("Commands:\n\r");
                putsUart0("  tx [data]\n\r");
                putsUart0("  rx\n\r");
                putsUart0("  info\n\r");
            }

            putsUart0("\n\r> ");
        }
    }
}

//-----------------------------------------------------------------------------
// Main
//-----------------------------------------------------------------------------
void dumpnrfConfig();
int main(void)
{
    /** overview
     *  the wireless module (dubbed "NRF"), works around addresses. meaning it needs
     *      a address to TX and RX. this doesn't align well with what the class
     *      agreed to use for wireless. Anyways, to make this work we just TX and
     *      RX on a predetermined address and only use one of the "pipes" of the NRF.
     *      this is terrible utilization of the chip but its what it takes to make
     *      it work.
     *  the NRF dosent allow for data streaming, instead well be using 32Byte packets.
     *      you can see the packet outline in the "nrfPacketBase" structure. We'll
     *      be doing manual CRC checks so we can detect malformed packets
     *      (otherwise the hardware will ignore bad packets and we'll never know).
     *      we'll be using CRC-CCITT, because its what everyone uses (must be good?).
     *  over each frame:
     *      - any amount of packets may be transmitted
     *      - packets may START at any time during the frame.
     *
     * - all frame times are the same length
     * - there is a short interfarme time to allow packets to finish
     * - all interframe times are the same length
     * - dynamic # of frames
     *
     *   <---fame time----> <--interframe time--> <---frame time--------> <--interframe time-->
     *   ______________________________________________________________________________________
     *  | synch fame (#0)  |                     | frame #1 (unoccupied) |                     |
     *
     *      ^ the # of frames is 1,
     *      ^ the next available frame is #1
     */

    //---init----------------------------------------------------------------------

    initHw();

    // Setup UART0
    initUart0();
    setUart0BaudRate(UART0_BAUD, F_CPU);

    // Init timer
    initTimer();

    initNrf();
//    printNRFStats();

    // test NRF connection
    nrfSetPowerUp(true);
    while(nrfTestSPI()){
        setPinValue(RED_LED, 1);
        setPinValue(GREEN_LED, 0);
        waitMicrosecond(100e3);
        setPinValue(RED_LED, 0);
        setPinValue(GREEN_LED, 1);
        waitMicrosecond(100e3);
    }
    nrfSetPowerUp(false);

    //---init nrf------------------------------------------------

    putsUart0("\n\rCSE4352 spring2025 project 2 team 14. N24L01+ RF transceiver demo\n\r");

    setPinValue(RED_LED, 1);
    setPinValue(GREEN_LED, 1);
    waitMicrosecond(100e3);
    setPinValue(RED_LED, 0);
    setPinValue(GREEN_LED, 0);
    waitMicrosecond(100e3);


    //---main----------------------------------------------------------------------

    while (true) {
        processShell();
    }
}

void printNRFStats(){
    {
        for(uint8_t i = 0; i <= 5; i++){
            NRFPipes pipe;
            switch(i){
                case 0: pipe.EN_RXADDR_DATAPIPE_0 = true; break;
                case 1: pipe.EN_RXADDR_DATAPIPE_1 = true; break;
                case 2: pipe.EN_RXADDR_DATAPIPE_2 = true; break;
                case 3: pipe.EN_RXADDR_DATAPIPE_3 = true; break;
                case 4: pipe.EN_RXADDR_DATAPIPE_4 = true; break;
                case 5: pipe.EN_RXADDR_DATAPIPE_5 = true; break;
                default: break;
            }
            uint8_t count;
            nrfGetPipeFIFOCount(pipe, &count);
            char str[20];
            snprintf(str,sizeof(str), "pipe %d size: %2d\n\r",i ,count);
            putsUart0(str);
        }
    }
    NRFFIFOStatus fifostatus;
    nrfReadRegister(NRF_REG_FIFO_STATUS_ADDR, &fifostatus.raw, sizeof(fifostatus));

    if(fifostatus.RX_EMPTY){
        putsUart0("rx empty\n\r");
    }
    if(fifostatus.RX_FULL){
        putsUart0("rx full\n\r\t");
        nrfPacketBase pkt;
        nrfReadRXPayload(pkt.rawArr, sizeof(pkt));
        nrfFlushRXFIFO();
        for(int i = 0; i < sizeof(pkt); i++){
            static char str[20];
            snprintf(str,sizeof(str), "%02x ",pkt.rawArr[i]);
            putsUart0(str);
        }
        putsUart0("\n\r");
    }
    if(fifostatus.TX_EMPTY){
        putsUart0("tx empty\n\r");
    }
    if(fifostatus.TX_FULL){
        putsUart0("tx full\n\r");
        nrfFlushTXFIFO();
    }
    if(fifostatus.TX_REUSE){
        putsUart0("tx reuse\n\r");
    }

    if(!fifostatus.RX_EMPTY && !fifostatus.RX_FULL)
        putsUart0("rx partially full\n\r");
    if(!fifostatus.TX_EMPTY && !fifostatus.TX_FULL)
        putsUart0("tx partially full\n\r");

    if(nrfIsReceivedPowerDetected()){
           putsUart0("carrier wave detected\n\r");
        } else
            putsUart0("carrier wave NOT detected\n\r");

    {// print TX & rx addrs
        static char str[40];
        uint8_t addr[5];

        nrfReadRegister(NRF_REG_TX_ADDR_ADDR, addr, 5);
        putsUart0("TX addr: ");
        for(int i = 0; i < sizeof(addr); i++){
            snprintf(str,sizeof(str), "%02x ", addr[i]);
            putsUart0(str);
        }
        putsUart0("\n\r");

        for(int i = 0; i <=5; i++){
            snprintf(str, sizeof(str), "RX p%d addr: ", i);
            putsUart0(str);
            int len = (i == 0) ? 5 : 1;
            nrfReadRegister(NRF_REG_RX_ADDR_P0_ADDR+i, addr, len);
            for(int i = 0; i < len; i++){
                snprintf(str, sizeof(str), "%02x ", addr[i]);
                putsUart0(str);
            }
            putsUart0("\n\r");
        }
    }

    dumpnrfConfig();
    putsUart0("--------------\n\r");


    setPinValue(GREEN_LED, nrfIsIRQing());
}

void dumpnrfConfig(){
    NRFConfig config;
    nrfReadRegister(NRF_REG_CONFIG_ADDR, &config.raw, sizeof(config));

    putsUart0("crc 2B:      ");
    if(config.CRC_2or1_BYTE) putsUart0("1\n\r"); else putsUart0("0\n\r");
    putsUart0("enabled crc: ");
    if(config.ENABLE_CRC) putsUart0("1\n\r"); else putsUart0("0\n\r");
    putsUart0("mask max RT: ");
    if(config.MASK_MAX_RT) putsUart0("1\n\r"); else putsUart0("0\n\r");
    putsUart0("mask RX DR:  ");
    if(config.MASK_RX_DR) putsUart0("1\n\r"); else putsUart0("0\n\r");
    putsUart0("mask TX DS:  ");
    if(config.MASK_TX_DS) putsUart0("1\n\r"); else putsUart0("0\n\r");
    putsUart0("power up:    ");
    if(config.POWER_UP) putsUart0("1\n\r"); else putsUart0("0\n\r");
    putsUart0("prime rx:    ");
    if(config.PRIME_RX) putsUart0("1\n\r"); else putsUart0("0\n\r");
}

void printNRFStatus(NRFStatus status){
    putsUart0("status ");
    putsUart0("\n\r     max_RT:         ");
    putcUart0('0' + status.MAX_RT);
    putsUart0("\n\r     rx data ready:  ");
    putcUart0('0' + status.RX_DATAREADY);
    putsUart0("\n\r     rx pipe:       ");
    {
        if(status.RX_PAYLOAD_PIPE == 7)
            putsUart0("empty");
        else {
            char str[20];
            snprintf(str,sizeof(str), "%2d ", status.RX_PAYLOAD_PIPE);
            putsUart0(str);
        }
    }
    putsUart0("\n\r     tx data sent:   ");
    putcUart0('0' + status.TX_DATASENT);
    putsUart0("\n\r     tx full:        ");
    putcUart0('0' + status.TX_FULL);
    putsUart0("\n\r");
}

void printFIFORX(){
    NRFFIFOStatus fifostatus;
    nrfReadRegister(NRF_REG_FIFO_STATUS_ADDR, &fifostatus.raw, sizeof(fifostatus));

    if(fifostatus.RX_EMPTY){
        putsUart0("rx empty\n\r");
    }
    if(fifostatus.RX_FULL){
        putsUart0("rx full\n\r\t");
        nrfPacketBase pkt;
        nrfReadRXPayload(pkt.rawArr, sizeof(pkt));
        for(int i = 0; i < sizeof(pkt); i++){
            static char str[20];
            snprintf(str,sizeof(str), "%02x ",pkt.rawArr[i]);
            putsUart0(str);
        }
        putsUart0("\n\r");
    }

    if(!fifostatus.RX_EMPTY && !fifostatus.RX_FULL){
        putsUart0("rx partially full\n\r");
        printNRFStatus(nrfGetStatus());
    }
}

void printFIFOTX(){
    NRFFIFOStatus fifostatus;
    nrfReadRegister(NRF_REG_FIFO_STATUS_ADDR, &fifostatus.raw, sizeof(fifostatus));

    if(fifostatus.TX_EMPTY){
        putsUart0("tx empty\n\r");
    }
    if(fifostatus.TX_FULL){
        putsUart0("tx full\n\r");
    }
    if(fifostatus.TX_REUSE){
        putsUart0("tx reuse\n\r");
    }

    if(!fifostatus.TX_EMPTY && !fifostatus.TX_FULL){
        putsUart0("tx partially full\n\r");
        printNRFStatus(nrfGetStatus());
    }
}
